# Clone Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Curve..::..Clone Method
Curve Class See Also
---
Returns a copy of this curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Curve Clone()
```

Visual Basic
---
```text
Public Function Clone As Curve
```

Visual C++
---
```text
public:
Curve^ Clone()
```

# ### Return Value
A copy of this curve.
# See Also
Curve Class
Autodesk.Revit.DB Namespace